# frozen_string_literal: true

# databases & deps
brew 'imagemagick'
brew 'graphviz'
brew 'plantuml'

# asdf
brew 'asdf'
brew 'coreutils'
brew 'automake'
brew 'autoconf'
brew 'openssl'
brew 'libyaml'
brew 'readline'
brew 'libxslt'
brew 'libtool'
brew 'unixodbc'
brew 'unzip'
brew 'curl'
brew 'cmake'
brew 'jq'

# asdf-erlang
brew 'wxwidgets'
brew 'fop'

# workflow & editors
brew 'vim'
brew 'antibody'
brew 'fzf'
brew 'git'
brew 'pinentry'
brew 'pinentry-mac'
brew 'zsh'
brew 'task'
brew 'tmux'
brew 'git-crypt'
brew 'ripgrep'
brew 'fd'
brew 'yarn'
brew 'watch'
brew 'stern'
brew 'mas'

tap 'railwaycat/emacsmacport'
brew 'railwaycat/emacsmacport/emacs-mac', args: ['with-modules']
brew 'wget'
brew 'aspell'

# chromic
brew 'xpdf'
brew 'verapdf'

# cask
tap 'homebrew/cask'
cask 'spectacle'
cask '1Password'
cask 'google-chrome'
cask 'firefox'
cask 'chromedriver'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-fira-sans'

tap 'pmeinhardt/tools'
brew 'pmeinhardt/tools/hmm', args: ['HEAD']

brew 'gpg2'
cask 'docker'
brew 'kind'
brew 'kubernetes-cli'

cask 'alacritty'
cask 'spotify'
cask 'insomnia'
cask 'lens'
cask 'keycastr'
cask 'discord'
cask 'microsoft-teams'
cask 'slack'
cask 'kap'
cask 'pgadmin4'
cask 'keybase'

tap 'homebrew/cask-drivers'
cask 'obinskit'

mas 'Amphetamine', id: 937_984_704
mas 'Dashlane', id: 517_914_548
mas 'Irvue', id: 1_039_633_667
mas 'IthoughtsX', id: 720_669_838
