# databases & deps
brew "elasticsearch"
brew "redis"
brew "imagemagick"
brew "graphviz"
brew "yarn"
brew "plantuml"

# asdf
brew "asdf"
brew "coreutils"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "unzip"
brew "curl"
# asdf-erlang
brew "wxmac"

# workflow & editors
brew "vim"
brew "fzf"
brew "git"
brew "pinentry"
brew "pinentry-mac"
brew "zsh"
brew "task"

tap "railwaycat/emacsmacport"
cask "emacs-mac", args: ["with-modules"]

# cask
tap "homebrew/cask"
cask "spectacle"
cask "1Password"
cask "Dashlane"
cask "google-chrome"
cask "firefox"

tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-fira-sans"

tap pmeinhardt/tools
cask "pmeinhardt/tools/hmm", args: ["HEAD"]
