# frozen_string_literal: true

# asdf
brew 'asdf'
brew 'autoconf'
brew 'automake'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'libtool'
brew 'libyaml'
brew 'openssl'
brew 'readline'
brew 'unixodbc'
brew 'unzip'

# asdf-erlang
brew 'fop'
brew 'libxslt'
brew 'openssl@1.1'
brew 'wxwidgets'

# asdf-postgres
brew 'gcc'
brew 'ossp-uuid'
brew 'readline'
brew 'zlib'

# tools
brew 'ack'
brew 'antidote'
brew 'bash'
brew 'fswatch'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-crypt'
brew 'go'
brew 'graphviz'
brew 'imagemagick'
brew 'jq'
brew 'make'
brew 'pinentry'
brew 'pinentry-mac'
brew 'plantuml'
brew 'shellcheck'
brew 'task'
brew 'tmux'
brew 'vim'
brew 'watch'
brew 'yarn'
brew 'zsh'

# emacs doom
#
tap 'd12frosted/emacs-plus'
brew 'emacs-plus', args: ["with-modern-doom3-icon"]
brew 'aspell'
brew 'grep'
brew 'editorconfig'
brew 'ripgrep'
brew 'fd'
brew 'tree-sitter'

# Handy tools
brew 'gource'
brew 'dos2unix'
brew 'wget'
brew 'gpg2'
brew 'dialog'

tap 'pmeinhardt/tools'
brew 'pmeinhardt/tools/hmm', args: ['HEAD']

# mkdocs
brew 'python'

# chromic
brew 'xpdf'
brew 'verapdf'
brew 'ghostscript'

# kube
brew 'kind'
brew 'kubernetes-cli'
brew 'stern'
brew 'mkcert'
brew 'nss'

tap 'ionos-cloud/ionos-cloud'
brew 'ionos-cloud/ionos-cloud/ionosctl'

tap 'hashicorp/tap'
brew 'hashicorp/tap/terraform'

# cask
cask 'rectangle'
cask '1Password'
cask 'google-chrome'
cask 'firefox'
cask 'chromedriver'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-fira-sans'

cask 'docker'
cask 'alacritty'
cask 'spotify'
cask 'keycastr'
cask 'discord'
cask 'microsoft-teams'
cask 'slack'
cask 'kap'
cask 'pgadmin4'
cask 'keybase'
cask 'yed'
cask 'bruno'

tap 'homebrew/cask-drivers'
cask 'obinskit'

# brew additions
brew 'mas'

mas 'Amphetamine', id: 937_984_704
mas 'Dashlane', id: 517_914_548
mas 'Irvue', id: 1_039_633_667
mas 'IthoughtsX', id: 720_669_838
